import type { TimelineEntry } from "./types";

export const timelineUk: TimelineEntry[] = [
  {
    id: 1,
    period: "2019 - 2023",
    title: "Основи біоінформатики",
    description:
      "Розпочав академічний шлях, вивчаючи біологію в Київському національному університеті імені Тараса Шевченка, спеціалізуючись на біоінформатиці. Це забезпечило міцну основу в аналітичному мисленні та аналізі даних, досягнувши середнього балу 3.9.",
  },
  {
    id: 2,
    period: "2022 - 2023",
    title: "Раннє програмування та інновації",
    description:
      "Почав вивчати Python для застосувань у біоінформатиці, розробляючи інструмент візуалізації геномних даних для дипломного проєкту. Цей проєкт об'єднав біологію та IT, запаливши мою пристрасть до програмування та розробки програмного забезпечення.",
  },
  {
    id: 3,
    period: "2024 - 2025",
    title: "Full-Stack експертиза та керівництво AI інтерв'юером",
    description:
      "Розширив технічні навички через комплексні курси з Python, C та бекенд-розробки. Отримав практичний досвід як Full-Stack веб-розробник у відділі FLEX Університету Гете, де керував розробкою інноваційної системи інтерв'юера на основі ChatGPT, досягнувши 90% задоволеності клієнтів.",
  },
  {
    id: 4,
    period: "Чер 2025 - Жов 2026",
    title: "Full-Stack розробник у The Code Registry",
    description:
      "Спроєктував та розробив масштабовані веб-платформи з використанням Django та Angular, що підтримують понад 10 000 користувачів. Впровадив CI/CD конвеєри, скоротивши час розгортання на 50%. Посилив протоколи безпеки, що призвело до зменшення вразливостей на 60%.",
  },
  {
    id: 5,
    period: "Сер 2025 - Вер 2025",
    title: "Full Stack AI розробник (фріланс)",
    description:
      "Розробив веб-додаток на основі ШІ, використовуючи алгоритми машинного навчання для персоналізації досвіду користувачів. Впровадив інформаційну панель візуалізації даних з використанням Tableau, що надає зацікавленим сторонам інсайти в реальному часі. Провів користувацьке тестування, яке покращило зручність використання додатка на 15%.",
  },
  {
    id: 6,
    period: "Жов 2025 - досі",
    title: "Full Stack розробник у Ruth Miskin Training",
    description:
      "Очолюю розробку освітньої платформи з використанням Flask та React, підвищуючи рівень завершення курсів на 25%. Інтегрую сторонні API для розширення функціональності платформи. Використовую методології Agile для ефективного управління термінами проєкту.",
  },
];
